#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int Add(int x, int y)
//{
//	int z = 0;
//	z = x + y;
//	return z;
//}
//int main()
//{
//	//int a = 10;
//	//int b = 20;
//	//int max = 0;
//	//max = (a > b ? a : b);
//	//printf("%d\n", max);
//	int arr[10] = { 0 };
//	arr[4];//[] - 下标引用操作符
//	int a = 10;
//	int b = 20;
//	int sum = Add(a, b);//() - 函数调用操作符
//	printf("%d\n", sum);
//	return 0;
//}

//只要是正数，内存中存储的都是二进制的补码
//正数——原码，反码，补码  相同
//负数：
//原码             ——>         反码        ——>     补码
//直接按照正负				原码的符号位不变		  反码+1
//写出的二进制序列			其他位取反得到
//例：  -2
//     10000000000000000000000000000010     原码
//     11111111111111111111111111111101     反码
//     11111111111111111111111111111110     补码